function phs = linearPhase(px, py, N)
%
% フーリエ変換のシフト側に使う位相分布をつくる
% (px,py):シフト量，－１≦ｐｘ≦＋１，－１≦ｐｘ≦＋１，＋１に設定すると一番端に移動する
% N:画像のデータ数
%
%====================================================
%  位置シフトのための位相分布
%   (px,py)の設定
%           -1
%     ---------------
%     |      |      |
%     |      |      |
%  -1 -------0------- +1
%     |      |      |
%     |      |      |
%     ---------------
%           +1
%=====================================================

[X,Y] = meshgrid(-N/2:N/2-1,-N/2:N/2-1);

phs = exp( i * pi * ( Y*px + X*py ));
